[{"startTime": 0.0, "endTime": 6.0, "ref": "Meet Ann. She often shops from www.shoppingcart.com."}, {"startTime": 6.0, "endTime": 12.0, "ref": "She has her information like email ID, address, and credit card details saved on the website"}, {"startTime": 12.0, "endTime": 16.0, "ref": "to enable a faster and hassle-free shopping experience."}, {"startTime": 16.0, "endTime": 19.0, "ref": "The required information is stored in a server."}, {"startTime": 19.0, "endTime": 26.0, "ref": "One day, Ann received an email which stated her eligibility for a special discount voucher from shoppingcart.com."}, {"startTime": 26.0, "endTime": 32.0, "ref": "In order to receive the coupon code, she was asked to fill in her shoppingcart.com account credentials."}, {"startTime": 32.0, "endTime": 38.0, "ref": "This didn't seem fishy to her at the time, as she thought it was just an account verification step."}, {"startTime": 38.0, "endTime": 42.0, "ref": "Little did she realize the danger she would be facing."}, {"startTime": 42.0, "endTime": 47.0, "ref": "She was knocked off her feet when a substantial amount of money was wiped off her account."}, {"startTime": 47.0, "endTime": 49.0, "ref": "How do you think this happened?"}, {"startTime": 49.0, "endTime": 53.0, "ref": "Well, yes, the email she received was fake."}, {"startTime": 53.0, "endTime": 58.0, "ref": "Ann's shoppingcart.com account witnessed unauthorized access from a third party."}, {"startTime": 58.0, "endTime": 64.0, "ref": "This type of attack is known as a cyber attack, and the person who carries it out is called a hacker."}, {"startTime": 64.0, "endTime": 71.0, "ref": "Could Ann have prevented this attack? Indeed, she could have, with the help of cybersecurity."}, {"startTime": 71.0, "endTime": 76.0, "ref": "Cybersecurity involves techniques that help in securing various digital components,"}, {"startTime": 76.0, "endTime": 81.0, "ref": "networks, data, and computer systems from unauthorized digital access."}, {"startTime": 81.0, "endTime": 87.0, "ref": "There are multiple ways to implement cybersecurity, depending on the kind of network you are connected to"}, {"startTime": 87.0, "endTime": 90.0, "ref": "and the type of cyber attacks you are prone to."}, {"startTime": 90.0, "endTime": 95.0, "ref": "So, let's take a look at the various cyber attacks that Ann could have been exposed to."}, {"startTime": 95.0, "endTime": 103.0, "ref": "One of the most common types of cyber attacks is a malware attack like Trojan, Adware, and Spyware, to name a few."}, {"startTime": 103.0, "endTime": 107.0, "ref": "Had Ann downloaded any suspicious attachments online,"}, {"startTime": 107.0, "endTime": 113.0, "ref": "her system could have gotten corrupted by certain malicious viruses embedded within the attachments."}, {"startTime": 113.0, "endTime": 118.0, "ref": "Next is a phishing attack, the type of cyber attack which Ann experienced."}, {"startTime": 118.0, "endTime": 124.0, "ref": "Here, the hacker usually sends fraudulent emails, which appear to be coming from a legitimate source."}, {"startTime": 124.0, "endTime": 131.0, "ref": "This is done to install malware or to steal sensitive data like credit card information and login credentials."}, {"startTime": 131.0, "endTime": 135.0, "ref": "Another type of attack is the man-in-the-middle attack."}, {"startTime": 135.0, "endTime": 141.0, "ref": "Here, the hacker gains access to the information path between Ann's device and the website's server."}, {"startTime": 141.0, "endTime": 144.0, "ref": "The hacker's computer takes over Ann's IP address."}, {"startTime": 144.0, "endTime": 150.0, "ref": "By doing so, the communication line between Ann and the website is secretly intercepted."}, {"startTime": 150.0, "endTime": 155.0, "ref": "This commonly happens with unsecured Wi-Fi networks and also through malware."}, {"startTime": 155.0, "endTime": 159.0, "ref": "Password attack is one of the easiest ways to hack a system."}, {"startTime": 159.0, "endTime": 167.0, "ref": "Here, Ann's password could have been cracked by using either common passwords or trying all possible alphabetical combinations."}, {"startTime": 167.0, "endTime": 172.0, "ref": "To prevent future cyber attacks, Ann sought to implement a few cybersecurity practices."}, {"startTime": 172.0, "endTime": 175.0, "ref": "First, she installed a firewall."}, {"startTime": 175.0, "endTime": 180.0, "ref": "As the name suggests, it is a virtual wall between Ann's computer and the internet."}, {"startTime": 180.0, "endTime": 185.0, "ref": "Firewalls filter the incoming and outgoing traffic from your device to safeguard your network,"}, {"startTime": 185.0, "endTime": 190.0, "ref": "and they can either be software applications or hardware reinforcements."}, {"startTime": 190.0, "endTime": 193.0, "ref": "Secondly, Ann implemented honeypots."}, {"startTime": 193.0, "endTime": 200.0, "ref": "Just like how flowers attract bees, dummy computer systems called honeypots are used to attract attackers."}, {"startTime": 200.0, "endTime": 207.0, "ref": "These systems are made to look vulnerable in order to deceive attackers, and this in turn defends the real system."}, {"startTime": 207.0, "endTime": 212.0, "ref": "In addition to these, she also decided to use unique alphanumeric passwords,"}, {"startTime": 212.0, "endTime": 217.0, "ref": "anti-virus software, and started avoiding mails from unknown senders."}, {"startTime": 217.0, "endTime": 219.0, "ref": "That was Ann's story."}, {"startTime": 219.0, "endTime": 225.0, "ref": "Cyberattacks are not just confined to individuals, but also to public and private organizations."}, {"startTime": 225.0, "endTime": 231.0, "ref": "The cyberattacks carried out in such places are more deadly, and they result in colossal losses."}, {"startTime": 231.0, "endTime": 238.0, "ref": "Motives of such attacks are many, starting from tampering with crucial data to monetary gains."}, {"startTime": 238.0, "endTime": 242.0, "ref": "Let's have a look at a few of the cyberattacks that companies are subjected to."}, {"startTime": 242.0, "endTime": 249.0, "ref": "Various public sector organizations and large corporations face the Advanced Persistent Threat, APT."}, {"startTime": 249.0, "endTime": 257.0, "ref": "In this form of attack, hackers gain access to networks for a prolonged period in order to continuously gain confidential information."}, {"startTime": 257.0, "endTime": 262.0, "ref": "Companies also witness the Denial of Service attack, where networks are flooded with traffic,"}, {"startTime": 262.0, "endTime": 266.0, "ref": "which in turn leaves legitimate service requests unattended."}, {"startTime": 266.0, "endTime": 274.0, "ref": "A variant of this is the Distributed Denial of Service, DDoS, attack, when multiple systems are used to launch the attack."}, {"startTime": 274.0, "endTime": 282.0, "ref": "When a hacker manipulates a standard SQL query in a database-driven website, it is known as a SQL injection attack."}, {"startTime": 282.0, "endTime": 287.0, "ref": "By doing so, hackers can view, edit, and delete tables from databases."}, {"startTime": 287.0, "endTime": 295.0, "ref": "Amidst a plethora of cyberattacks, it is indeed a challenge for organizations with several networks and servers to ensure complete security."}, {"startTime": 295.0, "endTime": 305.0, "ref": "This is not an easy task, and to help with this, cybersecurity professionals are hired to work on identifying cyber threats and securing a company's network."}, {"startTime": 305.0, "endTime": 308.0, "ref": "There are multiple job roles in the field of cybersecurity."}, {"startTime": 308.0, "endTime": 314.0, "ref": "If hacking fascinates you, then the role of an ethical hacker is something to be explored."}, {"startTime": 314.0, "endTime": 319.0, "ref": "Such professionals try to explain a network's vulnerabilities, just like how a hacker would do,"}, {"startTime": 319.0, "endTime": 326.0, "ref": "but only to identify those vulnerabilities and resolve them for protection against an actual cyberattack."}, {"startTime": 326.0, "endTime": 333.0, "ref": "But if you are looking to design robust security structures, then the role of a security architect is more apt."}, {"startTime": 333.0, "endTime": 339.0, "ref": "A Chief Information Security Officer, CISO, plays a crucial role in enterprise security"}, {"startTime": 339.0, "endTime": 344.0, "ref": "and is entrusted with the overall safety of the information in an organization."}, {"startTime": 344.0, "endTime": 352.0, "ref": "So, here's a question for you. Identify the type of cyberattack where the hacker's system takes over the client's IP address."}, {"startTime": 352.0, "endTime": 355.0, "ref": "A. DDoS attack"}, {"startTime": 355.0, "endTime": 358.0, "ref": "B. Man-in-the-middle attack"}, {"startTime": 358.0, "endTime": 360.0, "ref": "C. Phishing attack"}, {"startTime": 360.0, "endTime": 363.0, "ref": "D. Password attack"}, {"startTime": 363.0, "endTime": 366.0, "ref": "Give it a thought and leave your answers in the comment section below."}, {"startTime": 366.0, "endTime": 369.0, "ref": "Three lucky winners will receive Amazon gift vouchers."}, {"startTime": 369.0, "endTime": 377.0, "ref": "With the increase in the production of global digital data, it is anticipated that cyberattacks will quadruple in the near future."}, {"startTime": 377.0, "endTime": 382.0, "ref": "Organizations are going to need cybersecurity professionals who can prevent these attacks."}, {"startTime": 382.0, "endTime": 388.0, "ref": "A career in the field of cybersecurity is lucrative and a very smart decision for professionals now."}, {"startTime": 388.0, "endTime": 395.0, "ref": "So, what are you waiting for? Get certified with SimplyLearn and become a cybersecurity expert."}, {"startTime": 395.0, "endTime": 399.0, "ref": "If you enjoyed this video, a thumbs up would be really appreciated."}, {"startTime": 399.0, "endTime": 408.0, "ref": "Don't forget to subscribe to the SimplyLearn channel and hit the bell icon to never miss an update on the latest trending technologies."}, {"startTime": 408.0, "endTime": 427.0, "ref": "Thank you for watching and stay tuned for more from SimplyLearn."}]